// ===============================================
//    Title: DP_IR_Default_Accounts_Creation
//    MITRE ATT&CK: T1078.001 - Valid Accounts: Default Accounts
//    Description:
//    Detects potential abuse of default or administrative accounts.
//    Looks for 'net user' or 'net localgroup' commands and correlates with
//    SecurityEvent 4732 (user added to Administrators group).
// ===============================================

DeviceProcessEvents
| where DeviceName  == "dp--art--dp"
| where TimeGenerated > ago(15m)
| where InitiatingProcessFileName has_any ("cmd.exe", "powershell.exe", "net.exe")
| where ProcessCommandLine has_any ("net user", "net localgroup", "Administrators", "Remote Desktop Users")
| project TimeGenerated, AccountUpn, ProcessCommandLine, InitiatingProcessFileName
| union (
    SecurityEvent
    | where EventID == 4732
    | where TargetUserName == "Administrators"
)


