// detections/{art_id}-account-create-enable.kql
SecurityEvent
| where EventID in (4720, 4722)
| project TimeGenerated, Computer, EventID, Account, SubjectAccount, TargetAccount, RenderedDescription
| order by TimeGenerated desc

// detections/{art_id}-admin-group.kql
SecurityEvent
| where EventID in (4728, 4732)
| project TimeGenerated, Computer, SubjectAccount, TargetAccount, RenderedDescription
| order by TimeGenerated desc
